// FullStack-розробник 5.0
// Модуль №22. Оператори
// JS HomeWork2

// Домашня робота 2 Олена Верба
//----------------------------------------------
//***1***
// Якщо змінна більше нуля - виведіть true, менше - false
// Перевірте це на варіантах  1, 0, -3.

// let num = 1; // let num = 0; // let num = -3;
// if (num > 0) {
//   console.log('true');
// }
// if (num < 0) {
//   console.log('false');
// }

// Перевірка:
// Якщо змінна дорівнює 1 -- в consolе виводиться "false".
// Якщо змінна дорівнює 0 -- нічого не виводиться в consolе,
// не було завдання виводу для 0.
// Якщо змінна дорівнює -3 -- в consolе виводиться "true".

//----------------------------------------------
//***2***
// Якщо змінна ="test" - виведіть true,
// Перевірте це на варіантах  'test', "qwerty", true

// let val = 'test'; //let val = "qwerty";   //let val = true;
// if (val == 'test') {
//   console.log('true');
// }

// Перевірка:
// Якщо змінна "test" -- в console виводиться "true".
// Якщо змінна "qwerty" -- нічого не виводиться,
// не було завдання виводу для іншої змінної окрім "test".
// Якщо змінна true -- нічого не виводиться, не було завдання виводу...

// Другий аріант виводу, якщо все ж таки
// потрібно виводити будь - який результат:
// let val = 'test'; //let val = "qwerty";   //let val = true;
// console.log(val == 'test');

//----------------------------------------------
//***3***
// Якщо змінна більше 10 -- відніміть 5,
// менше -- додайте 5, результат виведіть в консоль
// Перевірте це на варіантах  1, 10, 13.

// let variable = 1; //let variable = 10; //let variable = 13;
// if (variable > 10) {
//   console.log(variable - 5);
// }
// if (variable < 10) {
//   console.log(variable + 5);
// }

// Перевірка:
// Якщо змінна дорівнює 1 -- в console виводиться 6
// Якщо змінна дорівнює 10 -- нічого не виводиться в console, тому що
// не було завдання виводу для = 10
// Якщо змінна дорівнює 13 -- в console виводиться 8

//----------------------------------------------
//***4***
//Зробіть сервіс який отримує число від 1 до 12
// виведіть місяць який дорівнює числу

// let month = null;
// month = Number(prompt('Введіть ціле чісло від 1 до 12 -- згадайте місяць'));
// switch (month) {
//   case 1:
//     alert('Січень(укр)-- January(eng)');
//     break;
//   case 2:
//     alert('Лютий(укр)-- February(eng)');
//     break;
//   case 3:
//     alert('Березень(укр)-- March(eng)');
//     break;
//   case 4:
//     alert('Квітень(укр)-- April(eng)');
//     break;
//   case 5:
//     alert('Травень(укр)-- May(eng)');
//     break;
//   case 6:
//     alert('Червень(укр)-- June(eng)');
//     break;
//   case 7:
//     alert('Липень(укр)-- July(eng)');
//     break;
//   case 8:
//     alert('Серпень(укр)-- August(eng)');
//     break;
//   case 9:
//     alert('Вересень(укр)-- September(eng)');
//     break;
//   case 10:
//     alert('Жовтень(укр)-- October(eng)');
//     break;
//   case 11:
//     alert('Листопад(укр)-- November(eng)');
//     break;
//   case 12:
//     alert('Грудень(укр)-- December(eng)');
//     break;
//   default:
//     alert('Потрібно число від 1 до 12');
// }

//----------------------------------------------
//***5***
//Зробіть сервіс який отримує тризначне число
//Поверніть користувачу сумму цих чисел

// let numer = Number(
//   prompt('Cума чисел тризначного числа. Введіть ціле тризначне число '),
// );
// if (numer > 99 && numer < 1000) {
//   alert(
//     'Сума чисел ' +
//       [numer] +
//       ' = ' +
//       (Number(String(numer)[0]) +
//         Number(String(numer)[1]) +
//         Number(String(numer)[2])),
//   );
// } else {
//   alert('Придумайте число від 100 до 999');
// }

//----------------------------------------------
//----------------------------------------------
